Repository: Kirill-Ateev/kirillateev.art
Catalog: src/locales/*.po
Languages: ru

source: (click for next)
ru: (кликни для следующей)

source: 10 000 works
ru: 10 000 работ

source: 1024 works
ru: 1024 работы

source: 111 works
ru: 111 работ

source: 20 works
ru: 20 работ

source: 300 works
ru: 300 работ

source: 512 works
ru: 512 работ

source: 555 works
ru: 555 работ

source: A collection of 42 impressionist style photos.
ru: Коллекция из 42 фотографий в стиле импрессионизма.

source: A collection of animated vector images in kinetic minimalism style (kinimalism).
ru: Коллекция анимированных векторных изображений в стиле кинетического минимализма (кинимализм).

source: A collection of collages of CC0 images in an abstractionist style.
ru: Коллекция коллажей из CC0 изображений в стиле абстракционизма.

source: A word-generative collection, a unique pattern of character states from <0>dobrofont</0>, a font drawn by special children.
ru: Коллекция словообразования, уникальный узор состояний символов из <0>доброшрифта</0>, нарисованного особенными детьми.

source: Community
ru: Сообщество

source: Compressed images and metadata stored on-chain, additionally the original photos stored on IPFS.
ru: Сжатые изображения и хранятся в блокчейне, дополнительно, оригинальные фото хранятся на IPFS.

source: Ethereum - April 2025
ru: Ethereum - Апрель 2025

source: Ethereum - August 2025
ru: Ethereum - Август 2025

source: Ethereum - December 2025
ru: Ethereum - Декабрь 2025

source: Ethereum - January 2026
ru: Ethereum - Январь 2026

source: Ethereum - Jun. 2023
ru: Ethereum - Июнь 2023

source: Ethereum - March 2025
ru: Ethereum - Март 2025

source: Ethereum - November 2025
ru: Ethereum - Ноябрь 2025

source: Ethereum - September 2025
ru: Ethereum - Сентябрь 2025

source: Hi, I'm Kirill Ateev, an artist working with code.
ru: Привет, я Кирилл Атеев, создаю искусство с помощью кода.

source: Images and metadata stored directly on blockchain (on-chain).
ru: Изображения и метаданные хранятся полностью в блокчейне (on-chain).

source: Images and metadata stored on IPFS.
ru: Изображения и метаданные хранятся в IPFS.

source: Kirill Ateev
ru: Кирилл Атеев

source: Kirill Ateev - Artist
ru: Кирилл Атеев - Artist

source: Kirill Ateev, artist, contemporary art, generative, community, exhibitions, portfolio
ru: Кирилл Атеев, художник, современное искусство, генеративное, сообщество, выставки, портфолио

source: Kirill Ateev's artwork
ru: работы Кирилла Атеева

source: Messages
ru: Сообщения

source: Polygon - Feb. 2023
ru: Polygon - Фев. 2023

source: Recent Community Work
ru: Недавние работы в сообществе

source: Recent Work
ru: Недавние работы

source: Some messages for you
ru: Некоторые сообщения для тебя

source: View collection >
ru: Посмотреть коллекцию >

source: Welcome to the official website of Kirill Ateev, a contemporary artist known for his unique generative artworks. Explore his portfolio, exhibitions, community, and more.
ru: Добро пожаловать на официальный сайт Кирилла Атеева, современного художника, известного своими уникальными генеративными работами. Ознакомьтесь с его портфолио, выставками, сообществом и многим другим.
